{
    "eng-8904924": {
        "articles": {
            "results": [
                {
                    "uri": "7734074558",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-16",
                    "time": "06:01:39",
                    "dateTime": "2023-09-16T06:01:39Z",
                    "dateTimePub": "2023-09-16T01:53:46Z",
                    "dataType": "news",
                    "sim": 0.6509804129600525,
                    "url": "https://www.thenewsherald.com/2023/09/16/football-carlson-ambushes-roosevelt-in-first-quarter-en-route-to-third-straight-win/",
                    "title": "FOOTBALL: Carlson ambushes Roosevelt in first quarter en route to third straight win",
                    "body": "A pair of 2-1 football teams in the Downriver League shared the gridiron Friday night as Gibraltar Carlson welcomed in Wyandotte Roosevelt.\n\nBoth teams came into the matchup looking to make it three straight victories following a loss in their respective season opener's back in Week 1. Roosevelt was also looking to snap a mini two-game skid head-to-head against Carlson.\n\nHeadlined by one of the crazier starts to a game anyone will encounter, the host Marauders used an explosive first quarter to earn a 55-7 win over the visiting Bears.\n\nPHOTO GALLERY: Football - Wyandotte Roosevelt vs Gibraltar Carlson\n\n\"This is a big one,\" Carlson head coach Jason Gendron said after the win. \"From the jump, we were ready for this one. Our boys have responded very well over the last three weeks, playing good football.\n\n\"I think we're starting to come into our own and find our identity.\"\n\nThe 55 points scored is the second time in as many weeks that Carlson has hung 50 on the board after cruising to a 57-12 win at Taylor a week prior. It's how they got to Friday's total that stole the show.\n\nThe Carlson offense had the ball six times in the first quarter, including three consecutive times before Roosevelt's offense could even run a play from scrimmage. Each first-quarter possession for the Marauders led to a touchdown, good for a 41-0 lead after just one period of play.\n\nIt started with the first drive of the game when quarterback Joe Krolak found Izaiah Wright downfield for 51 yards and a touchdown just three plays in, putting Carlson up 7-0 just 71 seconds into the game.\n\nThe Marauders then put up two more touchdowns over the next 3:31 after recovering not one, but the next two kickoffs on 'pooch' kicks from kicker Kyler Ostrowski. That set the hosts up with a short field, ending both drives with Wright rushing touchdowns from a few yards out.\n\nThat put Carlson up 21-0 before Roosevelt ran a single offensive play.\n\nThe Bears did manage to corral the next kickoff, only to go three and out and have their punt partially blocked. That allowed Carlson to set up shop in plus territory once more, and a few plays later, allowed Krolak to connect with Landon Vida from about 20 yards out.\n\nVida went up for the jump ball and beat his defender, coming down with possession and putting another six on the board for the blue and white. A missed point-after try made it a 27-0 game.\n\nThat missed PAT was probably the low point of the night for Carlson. They went on to score two more times before time expired in the first. One of those drives was the byproduct of Jackson Zachary intercepting Roosevelt quarterback Tommy Cappuccilli, while a third onside pooch kickoff was recovered after yet another Marauders score.\n\nKrolak hooked up with Zachary for 30 yards and the score on fourth down while Wright added a third rushing touchdown of the frame. That put Carlson up 41-0 after just one quarter of play.\n\n\"I can't tell you that I've seen anything like that before,\" Gendron said. \"But that's our brand of football, we wanted the ball to start in this one. We executed on special teams and our kids were hungry and fast to the ball. That is a credit to our staff and the kids for executing the game plan.\"\n\nRoosevelt head coach Jakob Zanski echoed a lot of his counterpart's sentiments on never seeing anything like what transpired in the opening 12 minutes on Friday.\n\n\"It's tough when you get a few pooch kicks in a row and our guys can't execute,\" Zanski said. \"(Carlson) got some nice bounces on those as well but that is more on us to recover those balls, at least jump on it. It was unfortunate for us and that was ultimately our demise.\"\n\nThe rest of the scoring in this one took place in the second quarter. Rushing touchdowns from Wright, his fourth of the game, as well as sophomore Trenton Ison capped off the scoring for Carlson.\n\nRoosevelt ended the Marauders' bid for a shutout in the final minute before halftime when Cappuccilli found wide receiver standout Chase Cline for a 74-yard deep ball catch-and-run.\n\nZanski talked about the importance of, as a coach, keeping up the overall morale and fight of his team as that Carlson ambush was unfolding early on. That \"never quit\" mentality is something he says has stood out to him the most since day one.\n\n\"It's very important,\" Zanski said. \"When you're down 40 and it's still the fourth quarter, it's tough. Our goal then was to keep clapping it up on the sidelines and do these positive things to keep the guys going, show (Carlson) that we're not going to back down.\"\n\nKrolak threw the ball just seven times, completing six of his passes for 127 yards. Carlson ran for over 200 yards on the ground with Wright accounting for nearly 150 of that on 11 carries. Fellow sophomore Avery Ortiz added 42 yards on 12 totes.\n\nWith the score as lopsided as it was, the running clock rule was in effect for the second half and the game played out until the end without a hitch.\n\nThe Week 5 slate of games will kick off on Friday, September 22 beginning at 7:00p.\n\nCarlson (3-1, 3-0 DRL) will stay home and welcome in an Anderson team that won its second straight game on Friday following a [] victory at home vs Taylor High. The Titans handed the Marauders' only loss in league play a season ago, a 33-28 final in Week 6 of the 2022 campaign.\n\n\"We stay locked in one week at a time,\" Gendron said. \"We know we got a big one next week with Southgate. We understand what happened last year when they got us. We were not looking ahead but now (Southgate) is on the clock.\"\n\nRoosevelt (2-2, 2-2 DRL) meanwhile will return home to host a Trenton team that picked up its third consecutive win after cruising to a 42-14 victory over Dearborn Edsel Ford on Friday. As was the case against Carlson, the Bears will be looking to snap a two-game slide against the Trojans in that Week 5 tilt.\n\n\"Of course, we'll take a look and what we did wrong,\" Zanski said. \"Especially on special teams, we have to tighten up and focus and execute. And the last four weeks, we have not executed well.\n\n\"Obviously we were fortunate enough to get wins each of the the last two weeks,\" Zanski continued. \"But when you play teams like Carlson tonight and Trenton coming up, you have to execute at all facets of the game.\"",
                    "source": {
                        "uri": "thenewsherald.com",
                        "dataType": "news",
                        "title": "The News-Herald"
                    },
                    "authors": [
                        {
                            "uri": "alexander_muller@thenewsherald.com",
                            "name": "Alexander Muller",
                            "type": "author",
                            "isAgency": false
                        }
                    ],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/McMaster_Marauders",
                            "type": "org",
                            "score": 5,
                            "label": {
                                "eng": "McMaster Marauders"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Franklin_D._Roosevelt",
                            "type": "person",
                            "score": 5,
                            "label": {
                                "eng": "Franklin D. Roosevelt"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Touchdown",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Touchdown"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Association_football",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Association football"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Wyandotte,_Michigan",
                            "type": "loc",
                            "score": 5,
                            "label": {
                                "eng": "Wyandotte, Michigan"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Wyandotte, Michigan"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Gibraltar",
                            "type": "loc",
                            "score": 5,
                            "label": {
                                "eng": "Gibraltar"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "Gibraltar"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Kickoff_(gridiron_football)",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Kickoff (gridiron football)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Head_coach",
                            "type": "org",
                            "score": 4,
                            "label": {
                                "eng": "Head coach"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Downriver_League",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Downriver League"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Quarterback",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Quarterback"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Conversion_(gridiron_football)",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Conversion (gridiron football)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Placekicker",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Placekicker"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Sophomore",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Sophomore"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Punt_(gridiron_football)",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Punt (gridiron football)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Jackson,_Mississippi",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Jackson, Mississippi"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Jackson, Mississippi"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Edsel_Ford",
                            "type": "person",
                            "score": 1,
                            "label": {
                                "eng": "Edsel Ford"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/American_football_positions",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "American football positions"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/USC_Trojans_football",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "USC Trojans football"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Cap_(sport)",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Cap (sport)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Tennessee_Titans",
                            "type": "org",
                            "score": 1,
                            "label": {
                                "eng": "Tennessee Titans"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Wide_receiver",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Wide receiver"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Shutout",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Shutout"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Trenton,_New_Jersey",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Trenton, New Jersey"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Trenton, New Jersey"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Southgate,_Michigan",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Southgate, Michigan"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Southgate, Michigan"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Dearborn,_Michigan",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Dearborn, Michigan"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Dearborn, Michigan"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        }
                    ],
                    "image": "https://www.thenewsherald.com/wp-content/uploads/2023/09/Wyandotte-vs-Carlson-Football-25.jpg?w=640",
                    "eventUri": "eng-8904924",
                    "sentiment": 0.3725490196078431,
                    "wgt": 432540099,
                    "relevance": 1
                },
                {
                    "uri": "7733573169",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-15",
                    "time": "21:48:13",
                    "dateTime": "2023-09-15T21:48:13Z",
                    "dateTimePub": "2023-09-15T21:46:26Z",
                    "dataType": "news",
                    "sim": 0.5803921818733215,
                    "url": "https://www.reviewjournal.com/sports/raiders/aj-cole-interviews-daniel-carlson-in-raiders-qa-for-rj-2905432/",
                    "title": "AJ Cole interviews Daniel Carlson in Raiders Q&A for RJ",
                    "body": "WHITE SULPHUR SPRINGS, W.Va. -- AJ Cole and Daniel Carlson form perhaps the NFL's best punter and kicker combination.\n\nThe Raiders' dynamic duo also spends a lot of time together getting to know each other through often bizarre but always entertaining conversations.\n\nSo for this week's Q&A, the Review-Journal asked Cole to put on the interviewer cap and interrogate his friend on a variety of topics from kicking philosophy to vegetables he would relegate to the practice squad.\n\nYeah, it gets weird.\n\nSo here's Cole's questions to the man he holds for on field goals and the answers provided by one of the league's best kickers.\n\nCole: Do you get more nervous for your own field goals or watching your little brother (Anders of the Green Bay Packers) kick?\n\nCarlson: My little brother, and it's not even close. It's much like I would imagine watching your kids play a sport where you really want them to succeed, but you have no control. I like being in the driver's seat, not sitting shotgun.\n\nCole: All sports competition between you and me. We're talking Frisbee golf, we're talking putt-putt, archery ...\n\nCarlson: Let me cut you off. It's me, and it's not close.\n\nCole: Everything. Basketball, pool, cornhole. Everything combined. Me and you. All sports, who's the better athlete?\n\nCarlson: We've had this discussion a lot. I think it's me; you think it's you. Maybe one day when we retire from this job, we can go battle it out and you'll find out.\n\nCole: OK, field-goal kicking is the sport, or the facet of a sport, that you are best at. What do you think is the sport you're worst at?\n\nCarlson: Gymnastics. I can do a backflip into water, but I've never done it on like a trampoline or anything.\n\nCole: OK, we're going to go with the start, bench or cut game. Broccoli, asparagus, cabbage. Go.\n\nCarlson: Each one has some issues and some good attributes. I'm going to cut cabbage. Start broccoli. Benching asparagus. I might elevate it from the practice squad. It depends what kind of garnishing it has on it.\n\nCole: What is the last thing that goes through your head right before the ball is snapped on a field goal?\n\nCarlson: Murder it. We can get a little more aggressive on the kickoff. On a field goal, it's more consistent. On a kickoff, there's some factors. Touchback, no touchback, wind, weather, placement. But I like when it's a smash-it type situation.\n\n(Long-snapper Jacob Bobenmoyer walks by and makes a chicken sound.)\n\nCole: OK, Bob just clucked, so what do you think the most overrated farm animal is?\n\nCarlson: I actually just watched 'Babe,' the movie about the pig. It had no purpose besides to eat, is what I learned in the movie. But they do taste delicious. Is a turkey a farm animal? I don't like them. But people do hunt them here in West Virginia, so I'll go with that.\n\nCole: One sentence, no commas or conjunctions to describe your attitude about field-goal kicking. Go.\n\nCarlson: Helping the team by doing something I have fine-tuned over and over again. Is there a comma in that?\n\nCole: Which article of clothing best represents you and encapsulates who you are as a man?\n\nCole: We're practicing at Greenbrier resort this week. What is your high, what is your low and what is your 'Wow?'\n\nCarlson: Camaraderie (laughter). That's a tough word. Wow is the scenery. The hills, the forest, the greenery we sometimes miss in Las Vegas. The low, I'd say this locker room smells kinda tough. There's a lot of bathrooms right in one spot with not a lot of air flow. I appreciate our facility back home.",
                    "source": {
                        "uri": "reviewjournal.com",
                        "dataType": "news",
                        "title": "Las Vegas Review-Journal"
                    },
                    "authors": [],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/Field_goal",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Field goal"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Punter_(gridiron_football)",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Punter (gridiron football)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Daniel_Carlson",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Daniel Carlson"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Placekicker",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Placekicker"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Vegetable",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Vegetable"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Green_Bay_Packers",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Green Bay Packers"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Practice_squad",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Practice squad"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/White_Sulphur_Springs,_West_Virginia",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "White Sulphur Springs, West Virginia"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "White Sulphur Springs, West Virginia"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Cornhole",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Cornhole"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Trampoline",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Trampoline"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Disc_golf",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Disc golf"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Archery",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Archery"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Miniature_golf",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Miniature golf"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Asparagus",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Asparagus"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Broccoli",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Broccoli"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Touchback",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Touchback"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Shotgun",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Shotgun"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Kickoff_(gridiron_football)",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Kickoff (gridiron football)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Cabbage",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Cabbage"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Track_and_field",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Track and field"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Gymnastics",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Gymnastics"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Basketball",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Basketball"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Las_Vegas",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Las Vegas"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Las Vegas"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/West_Virginia",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "West Virginia"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "West Virginia"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Greenbrier_County,_West_Virginia",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Greenbrier County, West Virginia"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Greenbrier County, West Virginia"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        }
                    ],
                    "image": "https://www.reviewjournal.com/wp-content/uploads/2023/09/18215635_web1_APTOPIX-Raiders-Cowboys-Football.jpg",
                    "eventUri": "eng-8904924",
                    "sentiment": 0.2784313725490195,
                    "wgt": 432510493,
                    "relevance": 1
                },
                {
                    "uri": "7733454007",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-15",
                    "time": "20:14:51",
                    "dateTime": "2023-09-15T20:14:51Z",
                    "dateTimePub": "2023-09-15T20:13:44Z",
                    "dataType": "news",
                    "sim": 0.6431372761726379,
                    "url": "https://www.inforum.com/news/south-dakota/doctor-charged-in-omaha-crash-that-killed-usd-graduate-student",
                    "title": "Doctor charged in Omaha crash that killed USD graduate student",
                    "body": "OMAHA, Neb. -- An Omaha doctor is facing criminal charges in connection with a car crash that killed a University of South Dakota student.\n\nOmaha VA Medical Center surgeon and University of Nebraska-Omaha professor Mark Carlson, 60, was charged Wednesday, Sept. 13, with manslaughter regarding the death of Anna Bosma, 22, of Sioux Falls.\n\nThe charges stem from 10:30 p.m. Sept. 1, when police in Omaha were called to the intersection of 62nd Street and Dodge Street for a report of a rollover crash. Upon arrival, authorities located Bosma's Chevy Cruze and Carlson's Mercedes E63 AMG both off the roadway.\n\nBosma's vehicle was overturned, and she was pronounced dead at the scene. Both Carlson and Bosma's passenger, William Story, were taken to an area hospital for treatment.\n\nIn an interview with Omaha TV news station KETV, Deputy Douglas County Attorney Brenda Beadle said she believes Carlson was racing another driver at high rates of speed when he lost control of the vehicle.\n\n\"Two vehicles were either racing or [in] a road rage incident. I believe [they were] racing down Dodge [Street] heading westbound when the suspect vehicle left its lane of traffic, struck a pole on the north side and then careened across several lanes of traffic,\" she said.\n\nBosma's vehicle, which was not involved in the race or road rage incident, was struck head-on after Carlson's vehicle crossed four lanes of traffic, a diagram included in court documents depicts.\n\nAfter obtaining a search warrant, investigators examined Carlson's airbag control module, where they were able to gather data regarding the vehicle's operation before the crash. The Omaha World-Herald reported that the module recorded Carlson was traveling at 106 mph and at full acceleration when he struck the pole. The data indicated his vehicle was traveling 101 mph when he collided with Bosma's vehicle.\n\nThe posted speed limit along that stretch of Dodge Street is 35 mph.\n\nCarlson is now facing a Class IIA felony, punishable by up to 20 years in prison. A warrant has been issued for his arrest as he recovers in a local hospital, KETV reported.\n\nBosma had graduated with honors from South Dakota State University in May, according to her obituary , and was enrolled in the University of South Dakota's occupational therapy doctorate program at the time of her death.",
                    "source": {
                        "uri": "inforum.com",
                        "dataType": "news",
                        "title": "INFORUM"
                    },
                    "authors": [],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/Mark_Carlson_(umpire)",
                            "type": "person",
                            "score": 5,
                            "label": {
                                "eng": "Mark Carlson (umpire)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Omaha,_Nebraska",
                            "type": "loc",
                            "score": 5,
                            "label": {
                                "eng": "Omaha, Nebraska"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Omaha, Nebraska"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Dodge_Street",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Dodge Street"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Mercedes-Benz_E-Class",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Mercedes-Benz E-Class"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/University_of_Nebraska_Omaha",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "University of Nebraska Omaha"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Intersection_(road)",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Intersection (road)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Chevrolet",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Chevrolet"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Road_rage",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Road rage"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Manslaughter",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Manslaughter"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/University_of_South_Dakota",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "University of South Dakota"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Traffic_collision",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Traffic collision"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Virginia",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "Virginia"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Virginia"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Sioux_Falls,_South_Dakota",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "Sioux Falls, South Dakota"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Sioux Falls, South Dakota"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/KETV",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "KETV"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Dodge",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Dodge"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Beadle_County,_South_Dakota",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Beadle County, South Dakota"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Beadle County, South Dakota"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Douglas_County,_Nebraska",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Douglas County, Nebraska"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Douglas County, Nebraska"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Omaha_World-Herald",
                            "type": "org",
                            "score": 1,
                            "label": {
                                "eng": "Omaha World-Herald"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Airbag",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Airbag"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/South_Dakota_State_University",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "South Dakota State University"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Search_warrant",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Search warrant"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Speed_limit",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Speed limit"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Felony",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Felony"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/South_Dakota",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "South Dakota"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "South Dakota"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        }
                    ],
                    "image": "https://cdn.forumcomm.com/dims4/default/b2a471f/2147483647/strip/true/crop/1000x464+0+0/resize/2297x1066!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Finforum%2Fbinary%2Fcopy%2F5d%2F0d%2F9f4a857201fa5cd1e8c504713345%2F2671772-police-binary-571427.jpg",
                    "eventUri": "eng-8904924",
                    "sentiment": -0.4196078431372549,
                    "wgt": 432504891,
                    "relevance": 1
                },
                {
                    "uri": "7733081388",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-15",
                    "time": "16:06:58",
                    "dateTime": "2023-09-15T16:06:58Z",
                    "dateTimePub": "2023-09-15T16:05:47Z",
                    "dataType": "news",
                    "sim": 0.6431372761726379,
                    "url": "https://nptelegraph.com/news/state-regional/crime-courts/omaha-surgeon-professor-charged-with-manslaughter-after-fatal-dodge-street-crash/article_fb08d390-6bbb-5db1-b4bb-1edd2cd757a7.html",
                    "title": "Omaha surgeon, professor charged with manslaughter after fatal Dodge Street crash",
                    "body": "The deadliest time, day and month for car accidents across the United States of America have been revealed. Forbes Advisor conducted a study using data from the National Highway Traffic Safety Administration between the years 2016 to 2020.\n\nAn Omaha surgeon has been charged with manslaughter after prosecutors said he was driving nearly 70 mph over the speed limit when he caused a fatal crash on Dodge Street earlier this month.\n\nMark A. Carlson, 61, faces one count of manslaughter in connection with the death of 22-year-old Anna Bosma of South Dakota. He remained in the hospital as of Wednesday, according to Deputy Douglas County Attorney Brenda Beadle, and will be taken into custody upon his release.\n\nIf convicted of manslaughter, Carlson faces up to 20 years in prison.\n\nAccording to an arrest affidavit for Carlson, Omaha police officers responded to a crash at 62nd and Dodge Streets at about 10:30 p.m. on Sept. 1. Bosma, who was driving a Chevrolet Cruze, was declared dead at the scene.\n\nCiting witness interviews and security footage, officers now allege that Carlson was either racing or engaged in a road rage incident with a black SUV driven by 26-year-old Cameron Robinson before the crash.\n\nAfter passing University Drive East, Carlson's Mercedes E63 AMG left the roadway and struck a metal light pole on the north side of Dodge Street with the rear passenger side of his car. Carlson then crossed four lanes of traffic -- three westbound lanes and one eastbound -- before entering the farthest eastbound lane and colliding with the Chevy Cruze.\n\nPolice applied for and were granted a search warrant for the air-bag control module on Carlson's Mercedes. The data showed that only about two seconds elapsed from the time Carlson hit the light pole to the impact with Bosma's car.\n\nListen now and subscribe: Apple Podcasts | Google Podcasts | Spotify | RSS Feed | Omny Studio\n\nAt the time of impact with the light pole, according to the affidavit, Carlson was traveling 106 mph with \"100% accelerator pedal input,\" meaning that he was still accelerating at full speed. Half a second before the impact with the Chevy Cruze, the accelerator pedal input remained at 100% and the vehicle was traveling 101 mph.\n\nThe speed limit in the area where the crash occurred is 35 mph.\n\nRobinson, the SUV driver who was allegedly racing Carlson, does not face any charges as of Wednesday. Beadle said that Robinson stayed at the scene of the crash and provided a statement to police, but the investigation remains open.\n\nAccording to his University of Nebraska Medical Center faculty page, Carlson is the director of the Center for Advanced Surgical Technology in addition to being a professor in the department of surgery. He is also a staff surgeon at Omaha's VA Medical Center.\n\nA spokesperson for the University of Nebraska Medical Center confirmed on Wednesday that a Mark A. Carlson is on the faculty in the department of surgery, but could not comment further on his employment status or confirm that it was the same person charged in relation to the crash.\n\nA spokesman for the VA Nebraska-Western Iowa Health Care System confirmed Wednesday that Carlson is a staff surgeon at the Omaha facility.\n\n\"We are saddened by the situation,\" the spokesman said in an email.\n\nBosma graduated from South Dakota State University in May, according to her obituary, and had just begun an occupational therapy doctorate program at the University of South Dakota. She had a deep love for animals and recently started a Facebook group to organize gatherings for people in Sioux Falls who owned Bernese Mountain Dogs.\n\n\"She was greatly loved, and she loved greatly in return,\" her obituary reads.\n\nOmaha World-Herald staff writer Julie Anderson contributed to this report.\n\nLocations Lincoln Tags Criminal Law Surgery Law Motor Vehicles Roads And Traffic Transportation University Police Education Security And Public Safety Automotive Industry Be the first to know\n\nGet local news delivered to your inbox!\n\nSign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy.",
                    "source": {
                        "uri": "nptelegraph.com",
                        "dataType": "news",
                        "title": "North Platte Nebraska's Newspaper"
                    },
                    "authors": [],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/Dodge_Street",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Dodge Street"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Manslaughter",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Manslaughter"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Chevrolet_Cruze",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Chevrolet Cruze"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Speed_limit",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Speed limit"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Omaha,_Nebraska",
                            "type": "loc",
                            "score": 4,
                            "label": {
                                "eng": "Omaha, Nebraska"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Omaha, Nebraska"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/SUV",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "SUV"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/National_Highway_Traffic_Safety_Administration",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "National Highway Traffic Safety Administration"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Throttle",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Throttle"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Chevrolet",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Chevrolet"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Affidavit",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Affidavit"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Traffic_collision",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Traffic collision"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Forbes",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Forbes"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/South_Dakota",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "South Dakota"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "South Dakota"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Beadle_County,_South_Dakota",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "Beadle County, South Dakota"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Beadle County, South Dakota"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Douglas_County,_Nebraska",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "Douglas County, Nebraska"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Douglas County, Nebraska"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/United_States",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "United States"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "United States"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/University_of_Nebraska_Medical_Center",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "University of Nebraska Medical Center"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Mercedes-Benz_E-Class",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Mercedes-Benz E-Class"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Road_rage",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Road rage"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Search_warrant",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Search warrant"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Mercedes-Benz",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Mercedes-Benz"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Spotify",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Spotify"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Google",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Google"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Apple_Inc.",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Apple Inc."
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Veterans_Health_Administration",
                            "type": "org",
                            "score": 1,
                            "label": {
                                "eng": "Veterans Health Administration"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Occupational_therapy",
                            "type": "org",
                            "score": 1,
                            "label": {
                                "eng": "Occupational therapy"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Omaha_World-Herald",
                            "type": "org",
                            "score": 1,
                            "label": {
                                "eng": "Omaha World-Herald"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/South_Dakota_State_University",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "South Dakota State University"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/University_of_South_Dakota",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "University of South Dakota"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Public_university",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Public university"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Privacy",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Privacy"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Traffic",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Traffic"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Email",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Email"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Automotive_industry",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Automotive industry"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Criminal_law",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Criminal law"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Facebook",
                            "type": "org",
                            "score": 1,
                            "label": {
                                "eng": "Facebook"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Virginia",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Virginia"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Virginia"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Sioux_Falls,_South_Dakota",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Sioux Falls, South Dakota"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Sioux Falls, South Dakota"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Lincoln,_Nebraska",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Lincoln, Nebraska"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Lincoln, Nebraska"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Iowa",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Iowa"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Iowa"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Bern",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Bern"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Bern"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "Switzerland"
                                    }
                                }
                            }
                        }
                    ],
                    "image": "https://bloximages.chicago2.vip.townnews.com/nptelegraph.com/content/tncms/assets/v3/editorial/f/b0/fb08d390-6bbb-5db1-b4bb-1edd2cd757a7/650474ad36b1b.preview.jpg?crop=1920%2C1008%2C0%2C35&resize=438%2C230&order=crop%2Cresize",
                    "eventUri": "eng-8904924",
                    "sentiment": -0.3176470588235294,
                    "wgt": 432490018,
                    "relevance": 1
                },
                {
                    "uri": "7732978276",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-15",
                    "time": "15:05:11",
                    "dateTime": "2023-09-15T15:05:11Z",
                    "dateTimePub": "2023-09-15T15:00:12Z",
                    "dataType": "news",
                    "sim": 0.6549019813537598,
                    "url": "https://zonecoverage.com/?p=155927",
                    "title": "Carlson's Leg Can Be A Difference Maker - Zone Coverage",
                    "body": "The new-look Green Bay Packers had one heck of an opening performance against the Chicago Bears, trouncing their rivals 38-0. While all eyes were on Jordan Love and his offense, Love wasn't the only one in the spotlight after replacing a franchise legend.\n\nAfter a rocky offseason, Anders Carlson showed off his impressive leg in his regular-season debut. Replacing Mason Crosby, the franchise's all-time leading scorer, was always a daunting task. But the rookie proved the lights weren't too bright for him with a perfect day.\n\nOne game is a small litmus test, but Carlson is showing why the Packers gambled on his upside. If he can stay consistent, and the Packers remain patient, Carlson's leg strength could be a difference maker in helping the young offense.\n\nIt's not easy being a kicker in the NFL. You're expected to be automatic lest you earn the ire of your team's fanbase. It's a given you should make extra points; you won't receive any glory for it. And unlike other positions, you're on your own in a high-pressure situation. Many teams won't take the risk of drafting a kicker, and those that do often regret it or move on early.\n\nThe Carlson pick looked like a reach at the time. Draft consensus didn't have Carlson as a priority pickup, and he probably could have been brought in as a UDFA. But Green Bay loved the former Auburn Tiger's leg strength and upside. The connection with Rich Bisaccia, who helped turn Anders' brother Daniel from a potential bust to one of the league's best kickers, made the pick make sense.\n\nCarlson's big leg is appealing for a cold-weather team like the Packers, but his accuracy left something to be desired. That continued through this off-season, with lots of ups and downs for the rookie. However, Carlson always seemed to play his best in high-pressure situations. Carlson was near-perfect on Family Night, and his preseason featured more good than bad.\n\nHe carried that energy into his regular-season debut with a perfect day. Carlson went 5/5 on extra points and ended the first half with a booming 52-yarder down the middle that would have been good from 60 or more.\n\nVia Acme Packing Company's Paul Noonan, Carlson's 52-yard field goal was the second-longest to start a career in franchise history. Only Mason Crosby's own debut, featuring a 53-yarder in a win over the Philadelphia Eagles, was longer. That's good company to be in.\n\nGreen Bay's offense rolled along in the second half, not needing too much from Carlson's leg. But the rookie did everything right.\n\nMatt LaFleur praised his young kicker, especially on the field goal. With the first half winding down, Love and Luke Musgrave badly missed on a potential touchdown. Carlson dealt with a high-pressure, long field goal with some clock weirdness and a high snap but nailed the kick with plenty to spare.\n\n\"That was the plan,\" LaFleur joked. \"We were trying to put him in the worst possible situation.\"\n\nIn addition to Carlson's leg, LaFleur and Bisaccia praised his mental makeup multiple times this offseason. Being a kicker is a very lonely position, and the lows can be tough to recover from. Carlson has shown an ability to bounce back when needed.\n\nThankfully, he didn't need to show that ability this Sunday. Instead, last week's victory is a foundation for the young kicker to build from. He's seen that he can walk into enemy territory under the big lights and come out on top. That's a huge confidence booster.\n\nNot every game will go like this one for Carlson, though. A rookie kicker is bound to have some bad games that will make fans cry out for a new kicker. Even on those bad days, Carlson's Week 1 performance should remind fans of his upside and why we should be patient.\n\nThe offense didn't move the ball super well during the first half, and the Love and Co. will face tougher defenses than the Bears in the coming weeks. The offense has already dealt with a few pesky hamstring injuries and won't always be at full capacity. Even if Love is the guy we hope he is, having a big-legged kicker can make a world of difference.\n\nWith a young offense and a defense that hasn't always played to its talent level, the Packers were always going to need to lean on special teams a bit. Having a rookie kicker made that a little less reliable, especially after he had such a rocky off-season. But Carlson has shown he can be a gamer when it counts. If he can stay consistent and build off of an impressive Week 1, his mighty leg can be a difference-maker.",
                    "source": {
                        "uri": "zonecoverage.com",
                        "dataType": "news",
                        "title": "Zone Coverage"
                    },
                    "authors": [
                        {
                            "uri": "matt_hendershott@zonecoverage.com",
                            "name": "Matt Hendershott",
                            "type": "author",
                            "isAgency": false
                        }
                    ],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/Placekicker",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Placekicker"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Mason_Crosby",
                            "type": "person",
                            "score": 4,
                            "label": {
                                "eng": "Mason Crosby"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Rookie",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Rookie"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Green_Bay_Packers",
                            "type": "org",
                            "score": 4,
                            "label": {
                                "eng": "Green Bay Packers"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Anders_Carlson_(American_football)",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Anders Carlson (American football)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Conversion_(gridiron_football)",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Conversion (gridiron football)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Matt_LaFleur",
                            "type": "person",
                            "score": 3,
                            "label": {
                                "eng": "Matt LaFleur"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Field_goal",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Field goal"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Jordan_Love",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Jordan Love"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Chicago_Bears",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Chicago Bears"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Bisaccia",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "Bisaccia"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Bisaccia"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "Italy"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Auburn_Tigers_football",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Auburn Tigers football"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Philadelphia_Eagles",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Philadelphia Eagles"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Draft_(sports)",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Draft (sports)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Green_Bay,_Wisconsin",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Green Bay, Wisconsin"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Green Bay, Wisconsin"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Luke_Musgrave",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Luke Musgrave"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/American_football_positions",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "American football positions"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Hamstring",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Hamstring"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Touchdown",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Touchdown"
                            }
                        }
                    ],
                    "image": "https://zonecoverage.com/wp-content/uploads/2023/09/USATSI_21282631_168390100_lowres.jpg",
                    "eventUri": "eng-8904924",
                    "sentiment": 0.1372549019607843,
                    "wgt": 432486311,
                    "relevance": 1
                },
                {
                    "uri": "7732186629",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-15",
                    "time": "08:11:35",
                    "dateTime": "2023-09-15T08:11:35Z",
                    "dateTimePub": "2023-09-15T08:09:00Z",
                    "dataType": "news",
                    "sim": 0.7607843279838562,
                    "url": "https://yaledailynews.com/blog/2023/09/15/yls-program-director-resigns-after-acknowledging-broached-romantic-relationship-with-student-at-williams/",
                    "title": "YLS program director resigns after acknowledging broached romantic relationship with student at Williams - Yale Daily News",
                    "body": "Last week, Don Carlson, the former Executive Director of the Tsai Leadership Program at Yale Law School, resigned from his role after suspending his campaign for Rhode Island's first congressional district in late August.\n\nIn the summer of 2019, economics professor Don Carlson was told he could no longer teach at Williams College.\n\nCarlson, who announced his candidacy for Rhode Island's 1st District seat in the U.S. House of Representatives in April this year, withdrew from the race in late August.\n\nCarlson's unexpected campaign suspension came just four days after allegations emerged on Aug. 23 that Carlson made a romantic overture to a student while teaching at Williams.\n\nCarlson served as senior executive director of the Law School's Tsai Leadership Program starting in June 2022 -- a year before evidence of inappropriate conduct surfaced.\n\nCarlson resigned from his position last week in a letter to Law School Dean Heather Gerken. Prior to his resignation, Carlson had been on a leave of absence since June 1 due to his then-active congressional campaign.\n\n\"I made a firm decision to devote the next chapter of my career to service to the most vulnerable populations here in Rhode Island, regardless of whether I won or lost the primary election,\" Carlson wrote in a Sept. 12 email to the News. \"Right now I am actively pursuing new opportunities in philanthropy that have a more direct impact on the issues at the heart of my campaign ... I am very proud of all that my team accomplished to build a strong foundation for the Tsai Leadership Program during my year-long tenure.\"\n\nThe News reached out to the Law School on Sept. 5 for comment on Carlson's campaign suspension and alleged misconduct at Williams and followed up on Sept. 9.\n\nOn Monday, Sept. 11, Carlson's bio and headshot were removed from the Law School's website, Debra Kroszner, associate dean and chief of staff at the Law School told the News.\n\nThe Law School confirmed to the News on Tuesday, Sept. 12, that Carlson had formally resigned.\n\n\"Don Carlson was removed from the website this week as part of a standard process when someone leaves the school,\" Kroszner later told the News.\n\nCarlson's departure from Williams came after text messages surfaced in which Carlson allegedly alluded to a potential relationship with a graduating senior. At the time, Carlson was concluding a temporary, full-time faculty role teaching economics. A second student reported the text messages, although no formal Title IX complaint was ever filed against Carlson.\n\nCarlson was one of 12 Democratic candidates vying for Rhode Island's first congressional district. Shortly after radio station WPRI released its initial Aug. 23 investigation describing Carlson's alleged romantic overture and departure from Williams, his campaign denied the allegations in a public statement\n\nBut following the release of a second investigative report that added details to the earlier allegations, Carlson posted an Aug. 25 YouTube video message acknowledging the inappropriate conduct and expressing his regret.\n\nAlthough in the video, Carlson indicated that he intended to remain in the congressional race -- where he was the only openly LGBTQ+ candidate in this field -- he formally suspended his campaign on Aug. 27.\n\n\"This was my first time running for elective office. I was prepared for the highest level of scrutiny and nonstop challenges to my positions and character,\" Carlson wrote in a statement suspending his campaign. \"But this race has brought extraordinary stress on my family and close friends as well. That very high personal cost is more than I'm willing to pay for the honor of public service.\"\n\nAccording to WPRI, the text messages sent by Carlson allegedly suggested a relationship modeled on a website where people can pay to go on a date. In a later text, he also allegedly indicated that he would have liked to provide the student with $5,000 to assist him financially.\n\nIn Carlson's YouTube video statement, he said that he offered the money as \"seed capital\" for a post-graduation geothermal venture on the West Coast, which the student ultimately did not pursue -- nor did Carlson give the money. He also mentioned an awkward conversation where he misunderstood the student's description of a dating website but later apologized. Carlson firmly denied any romantic involvement with this or any other student, past or present, at any institution he's been part of.\n\n\"The allegations are disturbing, and our thoughts go out to everyone affected,\" Jim Reische, a spokesperson for Williams, told WPRI.\n\nAt Yale, Carlson began his role leading the Law School's Tsai Leadership Program in June 2022, three years after his suspension from Williams.\n\nHowever, he took a leave of absence from the University on June 1 to run for Rhode Island's 1st congressional district.\n\n\"Don Carlson was hired following a thorough vetting process conducted by a professional firm,\" Kroszner wrote in a statement to WPRI two weeks ago when the allegations first surfaced. \"We never received any information about these allegations or any other issues of concern.\"\n\nIn an email to the News, Carlson explained that he took a leave of absence knowing that at the time, there was a \"fair chance he would not return\" to the University. He explained that his initial one-year contract with the University was completed on June 1, so there was no guarantee of his returning to Yale. He said he submitted his voluntary resignation to Gerken last week after the election was over.\n\nKroszner also confirmed with the News that Carlson had decided not to return to the University following his leave of absence.\n\nWilliams College declined to provide further comment on this story.\n\nCarlson received his bachelor's degree in political economy at Williams College.",
                    "source": {
                        "uri": "yaledailynews.com",
                        "dataType": "news",
                        "title": "Yale Daily News"
                    },
                    "authors": [
                        {
                            "uri": "adam_walker@yaledailynews.com",
                            "name": "Adam Walker",
                            "type": "author",
                            "isAgency": false
                        }
                    ],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/Don_Carlson",
                            "type": "person",
                            "score": 5,
                            "label": {
                                "eng": "Don Carlson"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Rhode_Island",
                            "type": "loc",
                            "score": 5,
                            "label": {
                                "eng": "Rhode Island"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Rhode Island"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "United States"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Text_messaging",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Text messaging"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Romanticism",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Romanticism"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Economics",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Economics"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Heather_K._Gerken",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Heather K. Gerken"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/WPRI-TV",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "WPRI-TV"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/New_York's_1st_congressional_district",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "New York's 1st congressional district"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Yale_Law_School",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Yale Law School"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Executive_director",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Executive director"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Philanthropy",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Philanthropy"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Primary_election",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Primary election"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/United_States_House_of_Representatives",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "United States House of Representatives"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Title_IX",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Title IX"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Chief_of_staff",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Chief of staff"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Williams_College",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Williams College"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Radio_broadcasting",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Radio broadcasting"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Democratic_Party_(United_States)",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Democratic Party (United States)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/YouTube",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "YouTube"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/LGBT",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "LGBT"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Dean_(education)",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Dean (education)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Rhode_Island's_1st_congressional_district",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Rhode Island's 1st congressional district"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Bachelor's_degree",
                            "type": "org",
                            "score": 1,
                            "label": {
                                "eng": "Bachelor's degree"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Yale_University",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Yale University"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/West_Coast_of_the_United_States",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "West Coast of the United States"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Political_economy",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Political economy"
                            }
                        }
                    ],
                    "image": "https://yaledailynews.com/wp-content/uploads/2023/09/carlson_aw_StaffPhotographer_TimTai-1024x683.jpg",
                    "eventUri": "eng-8904924",
                    "sentiment": 0.0980392156862746,
                    "wgt": 432461495,
                    "relevance": 1
                },
                {
                    "uri": "7731548151",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-15",
                    "time": "00:20:08",
                    "dateTime": "2023-09-15T00:20:08Z",
                    "dateTimePub": "2023-09-15T00:08:49Z",
                    "dataType": "news",
                    "sim": 0.6705882549285889,
                    "url": "https://www.batimes.com.ar/news/argentina/javier-milei-claims-pope-francis-is-on-side-of-bloody-dictators-in-tucker-carlson-interview.phtml",
                    "title": "Milei claims Pope is on side of 'bloody dictators' in Tucker Carlson interview",
                    "body": "Right-wing US commentator airs 33-minute interview with libertarian presidential frontrunner on X social media platform; Milei lets rip at Pope Francis, gender ideology, abortion and \"communists.\"\n\nLibertarian presidential frontrunner Javier Milei used a high-profile interview with right-wing US commentator Tucker Carlson to attack Pope Francis, accusing the Argentine pontiff of being a \"Communist\" and cosying up to \"bloody\" dictatorships in Latin America.\n\nMilei, 52, granted the interview to Carlson last week and political onlookers were eagerly awaiting its release. The libertarian didn't disappoint his supporters, lashing out at Argentina's political \"caste,\" promising to fix runaway inflation, slamming abortion as immoral and questioning the science behind climate change.\n\nCarlson, 54, is almost as controversial as his interviewee. A former Fox News host, he was fired by the company back in May after the network made a US$787-million payout to settle a defamation case brought by an election technology company.\n\nSince then, the journalist has gone direct to viewers, snubbing offers to sign with traditional broadcasters and taking his own show direct to X, the social network formerly known as Twitter.\n\nSpeaking from a rooftop overlooking the Plaza de Mayo, Carlson opens the video released on Friday by explaining that Argentina was once one of the richest nations in the world, but that today it is a \"desperate country\" with an economy that has been \"in shambles ... for a long time.\"\n\nThe people too are \"desperate,\" continues Carlson, hinting at the cause for Milei's surge in popularity even before the libertarian has made it onto the screen.\n\nThe introduction carries on with the US commentator speaking about the worthlessness of Argentina's currency and small value of its banknotes, detailing that people use \"bricks of local currency, the peso, to pay for dinner.\"\n\n\"It feels like Weimar, Zimbabwe, but it's not. This is a developed country,\" Carlson tells the camera.\n\nPresenting the October 22 election as a fait accompli, the right-winger explains that \"frustration\" has \"built up\" among Argentina's population, \"including poor people,\" and that \"a man called Javier Milei is poised to become its next president.\"\n\nSince winning the PASO primaries, the 52-year-old economist - a \"traditional libertarian\" in Carlson's words - has been misrepresented in the \"hostile\" US press, who have even branded him \"far right\" and a \"Nazi,\" Carlson states. He, however, argues that the La Libertad Avanza \"didn't seem very radical\" compared to the insanity of Argentina in its present day.\n\nAfter Carlson's 'Us v Them' filmed monologue, Milei begins immediately letting rip as the camera cuts to the duo. The La Libertad Avanza leader jumps straight in.\n\nAsked about his tensions with the Argentine leader of the Catholic Church, Pope Francis, Milei goes on to accuse the Argentine pontiff of having \"great affinity with dictators such as [Fidel] Castro and [Nicolás] Maduro.\"\n\n\"He is on the side of these bloody dictatorships,\" says the La Libertad Avanza leader. \"He has an affinity for the murderous Communists. In fact, he does not condemn them.\"\n\nMilei also vowed to \"not do business with China\" or \"any communist\" - a definition he said included Russia's Vladimir Putin and Brazil's President Luiz Inácio Lula da Silva.\n\nThe ultra-libertarian economist also gave his views about abortion. \"We believe that liberalism is based on the unrestricted respect for another's life, based on the principle of non-aggression and in defence of the right to live and be free. One of the pillars [of liberalism] is to defend the right to live, and there's also a scientific explanation: life begins at conception, a new being is formed with a distinct DNA. It's true that the woman has rights over her own body, but this child is not her body. Therefore, an abortion is a homicide aggravated by the family-ties and the difference in relative force.\"\n\nCarlson also asked the Casa Rosada hopeful about former US president Donald Trump, who is also running for election in 2024.\n\n\"I would tell to him to continue his fight against socialism,\" Milei answered, \"because he's one of the few who truly understood what the fight against socialists and statists means. He perfectly understood that wealth creation resides in the private sector.\"\n\nHe continued: \"The State doesn't create wealth, it destroys it. The State cannot give anything because it doesn't produce anything, and when it wants to do it, it does it horribly. From my humble position, the only thing I could say is that he should double his efforts in the direction of defending the ideas of freedom without giving an inch to the socialists.\"\n\nBlaming Argentina's inflation woes on the country's \"embrace of socialist ideas more than 100 years ago, he vowed to solve runaway price hikes.\n\nTwenty-four hours prior to the release of his Milei interview, Carlson posted a 10-minute video on X that introduced Argentina's recent economic woes to viewers.\n\nThe controversial commentator offered a running commentary for most of the video, as well as short clips of interviews with a normal citizen and Milei's pick for foreign minister, Diana Mondino (though she was not presented as such).\n\nBut the most notable section of the video feature is when Carlson decides to visit a cueva (\"cave\"), the illegal money-changing exchange houses that are dotted at locations across the capital, in order to highlight the weakness of Argentina's currency and the government's strict currency controls. Familiar to the vast majority of porteños, the TV host seemed less at home in his curious surroundings. His producers, however, lean on the scales to help him make his point - Carlson's exchange is paid out in 100-peso bills, in order to accentuate the size of the \"brick\" of money he enjoys showing off the camera.\n\n(It may be a little unkind to say so, but maybe the fact that he only exchanged US$100 illegally at the cueva underlines the fact that Carlson's Fox News budgets are no more.)\n\nThe fall-out from the interview - and its potential impact on support for Milei - is still to come, but it's safe to ensure that the libertarian presidential frontrunner will at least be better known worldwide for his appearance on Carlson's show. Within 90 minutes of the feature's release it had already been viewed by more than one million people.",
                    "source": {
                        "uri": "batimes.com.ar",
                        "dataType": "news",
                        "title": "Buenos Aires Times"
                    },
                    "authors": [
                        {
                            "uri": "james_grainger@batimes.com.ar",
                            "name": "James Grainger",
                            "type": "author",
                            "isAgency": false
                        }
                    ],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/Javier_Milei",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Javier Milei"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Tucker_Carlson",
                            "type": "person",
                            "score": 5,
                            "label": {
                                "eng": "Tucker Carlson"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Libertarianism",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Libertarianism"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Right-wing_politics",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Right-wing politics"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Communism",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Communism"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Abortion",
                            "type": "wiki",
                            "score": 5,
                            "label": {
                                "eng": "Abortion"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Pope_Francis",
                            "type": "person",
                            "score": 5,
                            "label": {
                                "eng": "Pope Francis"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Argentina",
                            "type": "loc",
                            "score": 5,
                            "label": {
                                "eng": "Argentina"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "Argentina"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/La_Libertad_Avanza",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "La Libertad Avanza"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Currency",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Currency"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Dictatorship",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Dictatorship"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Pope",
                            "type": "loc",
                            "score": 4,
                            "label": {
                                "eng": "Pope"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Scientific_consensus_on_climate_change",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Scientific consensus on climate change"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Anti-gender_movement",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Anti-gender movement"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Plaza_de_Mayo",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "Plaza de Mayo"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Caste",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Caste"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Defamation",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Defamation"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Latin_America",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Latin America"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Socialism",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Socialism"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Journalist",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Journalist"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Social_media",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Social media"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Economist",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Economist"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Inflation",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Inflation"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Social_network",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Social network"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Twitter",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Twitter"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Radical_politics",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Radical politics"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Weimar_Republic",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Weimar Republic"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Fox_News",
                            "type": "org",
                            "score": 2,
                            "label": {
                                "eng": "Fox News"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Fidel_Castro",
                            "type": "person",
                            "score": 2,
                            "label": {
                                "eng": "Fidel Castro"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Nicolás_Maduro",
                            "type": "person",
                            "score": 2,
                            "label": {
                                "eng": "Nicolás Maduro"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Luiz_Inácio_Lula_da_Silva",
                            "type": "person",
                            "score": 2,
                            "label": {
                                "eng": "Luiz Inácio Lula da Silva"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Vladimir_Putin",
                            "type": "person",
                            "score": 2,
                            "label": {
                                "eng": "Vladimir Putin"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Zimbabwe",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Zimbabwe"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "Zimbabwe"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Russia",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Russia"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "Russia"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/China",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "China"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "China"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Brazil",
                            "type": "loc",
                            "score": 2,
                            "label": {
                                "eng": "Brazil"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "Brazil"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Casa_Rosada",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "Casa Rosada"
                            },
                            "location": null
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Donald_Trump",
                            "type": "person",
                            "score": 1,
                            "label": {
                                "eng": "Donald Trump"
                            }
                        }
                    ],
                    "image": "https://fotos.perfil.com/2023/09/14/trim/1140/641/milei-tucker-carlson-interview-1654430.jpeg",
                    "eventUri": "eng-8904924",
                    "sentiment": -0.09019607843137256,
                    "wgt": 432433208,
                    "relevance": 1
                },
                {
                    "uri": "7731495643",
                    "lang": "eng",
                    "isDuplicate": false,
                    "date": "2023-09-14",
                    "time": "23:32:46",
                    "dateTime": "2023-09-14T23:32:46Z",
                    "dateTimePub": "2023-09-14T17:22:26Z",
                    "dataType": "news",
                    "sim": 0.7450980544090271,
                    "url": "https://theminnesotasun.com/mn-news/tucker-carlson-travels-to-argentina-to-show-how-hyperinflation-devastated-the-countrys-economy/khousler/2023/09/14/",
                    "title": "Tucker Carlson Travels to Argentina to Show How 'Hyperinflation' Devastated the Country's Economy - The Minnesota Sun",
                    "body": "In episodes 23 and 24 of his newest production, \"Tucker on Twitter,\" Tucker Carlson traveled to Buenos Aires, Argentina to highlight how hyperinflation has devastated the country's economy as well as sit down for an interview with presidential candidate Javier Milei, a libertarian economist who is strongly against the current status quo.\n\nOn Wednesday, Carlson released a 10-minute preview of his trip to Argentina, where he visited the last money changer in the country that gives the \"actual exchange rate\" of pesos to U.S. dollars.\n\nIn what he described as a \"cave,\" Carlson was handed multiple bricks of Argentine pesos in exchange for one $100 bill.\n\nCarlson noted that the Argentine government \"lies about what its currency is worth and gives about half its value to people in exchange for dollars,\" which is why the government is trying to shut down the outposts such as the one visited by Carlson.\n\n\"They are stealing, and they are lying, and they are enforcing that lie at gunpoint. They close those places down because they're this little window into reality that the government can't tolerate,\" Carlson said. \"That's what a collapsing society looks like, everybody is moving backwards. Nobody can tell the truth about anything, the functions of ordinary life have to be conducted furtively in caves.\"\n\nArgentina defaulted on its debt in 2001 and now, as Carlson put it, \"hyperinflation has made this country genuinely desperate.\"\n\nOn Thursday, Carlson released his 32-minute interview with Milei, who blamed the country's economic disaster on socialist ideas.\n\n\"Argentina's embrace of socialist ideas began with an idea that seems attractive, but is actually a terrifying way to operate an economic system. The idea that 'when there is a need, there is a right,' it's a problem because there can be infinite needs but someone always has to pay for those rights,\" Milei argued.\n\nWhen asked what advice he would give to Americans in regards to rejecting socialism given his experience of living in a failed country due to such policies, Milei said, \"Never embrace the ideals of socialism. Never allow yourselves to be seduced by the siren song of social justice. Don't get caught up in that terrible concept that 'when there is a need, there is a right'.\"\n\nIn an new twist to his \"Tucker on X\" post, Carlson added a list of the topics he discussed by the Argentinan libertarian firebrand:\n\n(0:00) Intro\n\n(3:32) Inflation\n\n(6:00) Gender ideology\n\n(9:57) Abortion\n\n(11:45) Pope Francis' affinity for dictators\n\n(14:45) Architecture\n\n(17:52) Advice to Americans and Donald Trump\n\n(22:23) Climate change\n\n(27:55) China\n\n(29:18) Prayer\n\n(30:39) Violent political protests\n\nAs of press time, the two latest installments of Carlson's video podcast had over 60 million combined views. The 24 episodes posted by @TuckerCarlson have been seen over 1 billion times on Twitter / X.",
                    "source": {
                        "uri": "theminnesotasun.com",
                        "dataType": "news",
                        "title": "The Minnesota Sun"
                    },
                    "authors": [
                        {
                            "uri": "kaitlin_housler@theminnesotasun.com",
                            "name": "Kaitlin Housler",
                            "type": "author",
                            "isAgency": false
                        }
                    ],
                    "concepts": [
                        {
                            "uri": "http://en.wikipedia.org/wiki/Tucker_Carlson",
                            "type": "person",
                            "score": 5,
                            "label": {
                                "eng": "Tucker Carlson"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Hyperinflation",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Hyperinflation"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Javier_Milei",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Javier Milei"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Argentine_peso",
                            "type": "wiki",
                            "score": 4,
                            "label": {
                                "eng": "Argentine peso"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Argentina",
                            "type": "loc",
                            "score": 4,
                            "label": {
                                "eng": "Argentina"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "Argentina"
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Government_of_Argentina",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Government of Argentina"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Libertarianism",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Libertarianism"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Status_quo",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Status quo"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Socialism",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Socialism"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Exchange_rate",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Exchange rate"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Economist",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Economist"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Currency",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "Currency"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/United_States_dollar",
                            "type": "wiki",
                            "score": 3,
                            "label": {
                                "eng": "United States dollar"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Twitter",
                            "type": "org",
                            "score": 3,
                            "label": {
                                "eng": "Twitter"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Buenos_Aires",
                            "type": "loc",
                            "score": 3,
                            "label": {
                                "eng": "Buenos Aires"
                            },
                            "location": {
                                "type": "place",
                                "label": {
                                    "eng": "Buenos Aires"
                                },
                                "country": {
                                    "type": "country",
                                    "label": {
                                        "eng": "Argentina"
                                    }
                                }
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Default_(finance)",
                            "type": "wiki",
                            "score": 2,
                            "label": {
                                "eng": "Default (finance)"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Ideology",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Ideology"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Economic_system",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Economic system"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Dictator",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Dictator"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Climate_change",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Climate change"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Abortion",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Abortion"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Inflation",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Inflation"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Social_justice",
                            "type": "wiki",
                            "score": 1,
                            "label": {
                                "eng": "Social justice"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Pope_Francis",
                            "type": "person",
                            "score": 1,
                            "label": {
                                "eng": "Pope Francis"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/Donald_Trump",
                            "type": "person",
                            "score": 1,
                            "label": {
                                "eng": "Donald Trump"
                            }
                        },
                        {
                            "uri": "http://en.wikipedia.org/wiki/China",
                            "type": "loc",
                            "score": 1,
                            "label": {
                                "eng": "China"
                            },
                            "location": {
                                "type": "country",
                                "label": {
                                    "eng": "China"
                                }
                            }
                        }
                    ],
                    "image": "https://tennesseestar.com/wp-content/uploads/2023/09/tucker-Javier-Milei_840x480.jpg",
                    "eventUri": "eng-8904924",
                    "sentiment": -0.02745098039215688,
                    "wgt": 432430366,
                    "relevance": 1
                }
            ]
        }
    }
}